#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_sns_topic.error_parsing_alerts: Refreshing state... [id=arn:aws:sns:eu-west-3:505394176116:error-parsing-alerts-alarm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_sns_topic.alarm_topic will be created
  + resource "aws_sns_topic" "alarm_topic" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "error-parsing-alerts-alarm"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "Environment"          = "prod"
          + "Product"              = "error-parsing"
          + "Terraform"            = "true"
          + "Terraform Repository" = "github.com/aribasadme/error-parsing"
        }
      + tags_all                    = {
          + "Environment"          = "prod"
          + "Product"              = "error-parsing"
          + "Terraform"            = "true"
          + "Terraform Repository" = "github.com/aribasadme/error-parsing"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic.error_parsing_alerts will be destroyed
  # (because aws_sns_topic.error_parsing_alerts is not in configuration)
  - resource "aws_sns_topic" "error_parsing_alerts" {
      - application_success_feedback_sample_rate = 0 -> null
      - arn                                      = "arn:aws:sns:eu-west-3:505394176116:error-parsing-alerts-alarm" -> null
      - content_based_deduplication              = false -> null
      - fifo_topic                               = false -> null
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      - id                                       = "arn:aws:sns:eu-west-3:505394176116:error-parsing-alerts-alarm" -> null
      - lambda_success_feedback_sample_rate      = 0 -> null
      - name                                     = "error-parsing-alerts-alarm" -> null
      - owner                                    = "505394176116" -> null
      - policy                                   = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "505394176116"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:eu-west-3:505394176116:error-parsing-alerts-alarm"
                      - Sid       = "__default_statement_ID"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - signature_version                        = 0 -> null
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {
          - "Environment"          = "prod"
          - "Product"              = "error-parsing"
          - "Terraform"            = "true"
          - "Terraform Repository" = "github.com/aribasadme/error-parsing"
        } -> null
      - tags_all                                 = {
          - "Environment"          = "prod"
          - "Product"              = "error-parsing"
          - "Terraform"            = "true"
          - "Terraform Repository" = "github.com/aribasadme/error-parsing"
        } -> null
    }

  # aws_sns_topic_subscription.email_subscription will be created
  + resource "aws_sns_topic_subscription" "email_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "albert_r19@hotmail.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: ./terraform.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "./terraform.plan"

```

</details>

*Pushed by: @aribasadme, Action: `pull_request`*